---
kind: type
id: T:Autodesk.Revit.DB.EdgeArrayArray
source: html/7f25fe6f-a427-7ac3-6753-2dec37fb058c.htm
---
# Autodesk.Revit.DB.EdgeArrayArray

An array of edge arrays.

## Syntax (C#)
```csharp
public class EdgeArrayArray : APIObject,
	IEnumerable
```